app/Http/Controllers/QuestionsController.php

    public function index()
    {
        //\DB::enableQueryLog();
        $questions = Question::with('user')->latest()->paginate(5);
---
select * from `questions` order by `created_at` desc limit 5 offset 5
select * from `users` where `users`.`id` in (2, 3)
select count(*) as aggregate from `questions`